load_test_results/test1_full.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 200 requests
Completed 400 requests
Completed 600 requests
Completed 800 requests
Completed 1000 requests
Completed 1200 requests
Completed 1400 requests
Completed 1600 requests
Completed 1800 requests
Completed 2000 requests
Finished 2000 requests


Server Software:        nginx/1.24.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /health/
Document Length:        42 bytes

Concurrency Level:      10
Time taken for tests:   0.637 seconds
Complete requests:      2000
Failed requests:        0
Non-2xx responses:      2000
Total transferred:      684000 bytes
HTML transferred:       84000 bytes
Requests per second:    3140.95 [#/sec] (mean)
Time per request:       3.184 [ms] (mean)
Time per request:       0.318 [ms] (mean, across all concurrent requests)
Transfer rate:          1049.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     1    3   1.2      3      10
Waiting:        0    3   1.2      2      10
Total:          1    3   1.2      3      11

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      4
  80%      4
  90%      5
  95%      5
  98%      6
  99%      7
 100%     11 (longest request)